---
kind: type
id: T:Autodesk.Revit.DB.SpatialElementTag
source: html/0a20cdd6-6e44-bc77-a4c3-2d35470ba911.htm
---
# Autodesk.Revit.DB.SpatialElementTag

A tag attached to a SpatialElement (room, space or area) in Autodesk Revit.

## Syntax (C#)
```csharp
public class SpatialElementTag : Element
```

## Remarks
SpatialElementTag is the base class for RoomTag, SpaceTag and AreaTag.
 Zone tag is not derived from SpatialElementTag. See IndependentTag for more information.